// 정답에 대한 풀이를 적어주세요 !
// 만약 풀이 과정에서 코드가 필요하다면 코드도 작성 부탁드립니다 !

// 1번 문제 : 먼저 html file과 js file 연결하기 !
<script src="test.js"></script>
// 2번 문제 : Backend에서 얼마나 많은 프로그래밍 언어들을 사용할까요 ?
Python/ Java/ Js/ PHP/ Ruby/ Rust/ Kotlin/ C#/ Solidity/ Perl
// 3번 문제 : Frontend에서 얼마나 많은 프로그래밍 언어들을 사용할까요 ?
HTML, CSS, JS/ 
// 4번 문제 : 자바스크립트로 비디오 게임을 만들 수 있을까요 ?
yes
// 5번 문제 : 자바스크립트는 모든 브라우저들에 설치되어 있을까요 ?
yes
// 6번 문제 : 자바스크립트는 만들어진 기간은 얼마일까요 ?
10일
// 7번 문제 : 왜 자바스크립트는 만들어졌을까요 ?
좀 더 인터렉티브한 웹사이트를 만들기 위해
// 8번 문제 : 웹사이트에서 자바스크립트를 사용하려면 처음에 다운로드 해야할까요 ?
no: js는 모든 브라우저에 내장되어 있기 때문에 설치가 필요하지 않다.
// 9번 문제 : 자바스크립트를 실행하기위해 브라우저를 열어야할까요 ?
yes
// 10번 문제 : 브라우저에서 자바스크립트 파일을 실행하기위해 어떻게 해야할까요 ?
연결된 HTML 파일을 실행시킨다. JS 파일을 실행시킨다.
// 11번 문제 : 브라우저에서 console로 무엇을 할 수있을까요 ?
자바스크립트 코드 작성!
// 실습 코드 예시
// const a = 1.2;
// const b = 1;
// console.log(a, b)
// console.log(typeof(a), typeof(b)) 

// type을 확인하고 싶으면 ? 
// console로 찍고 싶으면 ? 
// 변수를 선언하고 싶으면 ? 
// 세가지를 잘 생각하며 실습해보세요 ! 

// 12번 문제 : 2와 2.2는 모두 같은 정수들일까 ?
no: 2는 integer, 2.2는 float이다.
// 13번 문제 : “2”의 데이터 타입은 무엇일까 ?
정수
// 14번 문제 : ‘hello’ 와 “hello” 는 같은 것일까 ?
yes
// 15번 문제 : 변수는 숫자 값만을 저장할 수 있을까 ?
no: 모든 데이터 타입을 저장할 수 있다.
// 16번 문제 : const 에 값을 저장 후 변경이 가능할까 ?
no: const는 재정의가 불가능하다.
// 17번 문제 : let 에 값을 저장 후 변경이 가능할까 ?
yes
// 18번 문제 : “true”는 Boolean 값일까 ?
no: true가 Boolean이다.
// 19번 문제 : null과 undefined는 같은 데이터 타입일까 ?
no: null은 변수 안에 아무 것도 없는것, undefined는 존재하지 않는 것
// 20번 문제 : 배열을 사용하는 이유는 무엇일까 ?
여러 개의 변수를 묶어서 사용하기 위해.
// 21번 문제 : 배열 두 번째 요소의 값을 어떻게 얻을 수 있을까 ?
arr[1]
// 22번 문제 : 객체 player의 name의 값을 어떻게 얻을 수 있을까 ?
player.name