// 정답에 대한 풀이를 적어주세요 !
// 만약 풀이 과정에서 코드가 필요하다면 코드도 작성 부탁드립니다 !

// 1번 문제 : 먼저 html file과 js file 연결하기 !
//파일로 연결하는 방법- 경로에 JS파일 생성-> JS코드 생성 -> HTML SCRIPT사용
//직접 코드 작성-경로에 HTML 파일 생성-> JS를 인식하는 태그 작성->SCRIPT태그안에 코드 작성

// 2번 문제 : Backend에서 얼마나 많은 프로그래밍 언어들을 사용할까요 ?
//10개 이상

// 3번 문제 : Frontend에서 얼마나 많은 프로그래밍 언어들을 사용할까요 ?
// 자바스크립트 하나

// 4번 문제 : 자바스크립트로 비디오 게임을 만들 수 있을까요 ?
//Yes

// 5번 문제 : 자바스크립트는 모든 브라우저들에 설치되어 있을까요 ?
//Yes

// 6번 문제 : 자바스크립트는 만들어진 기간은 얼마일까요 ?
//10일안에 만들어졌다.

// 7번 문제 : 왜 자바스크립트는 만들어졌을까요 ?
//넷스케이프라는 브라우저에서 기존의 웹페이지에서 좀 더 인터렉티브한 환경을 만들기 위해 만들어졌다.

// 8번 문제 : 웹사이트에서 자바스크립트를 사용하려면 처음에 다운로드 해야할까요 ?
//No. 모든 브라우저에 내장되어 있다.

// 9번 문제 : 자바스크립트를 실행하기위해 브라우저를 열어야할까요 ?
//Yes

// 10번 문제 : 브라우저에서 자바스크립트 파일을 실행하기위해 어떻게 해야할까요 ?
//브라우저를 열고 JS file을 연다!

// 11번 문제 : 브라우저에서 console로 무엇을 할 수있을까요 ?
// 자바스크립트 코드 작성!

// 실습 코드 예시
// const a = 1.2;
// const b = 1;
// console.log(a, b)
// console.log(typeof(a), typeof(b)) 

// type을 확인하고 싶으면 ? 
// console로 찍고 싶으면 ? 
// 변수를 선언하고 싶으면 ? 
// 세가지를 잘 생각하며 실습해보세요 ! 

// 12번 문제 : 2와 2.2는 모두 같은 정수들일까 ?
//        console.log(typeof(2));
//        console.log(typeof(2.2)); 같다. number

// 13번 문제 : “2”의 데이터 타입은 무엇일까 ?
//number

// 14번 문제 : ‘hello’ 와 “hello” 는 같은 것일까 ?
// console.log(typeof(true));
// consoe.log(typeof(false));

// console.log(typeof(“true”));
// consoe.log(typeof(“false”)); 
//'hello'인 경우에는 boolean 
//"hello"인 경우에는 string

// 15번 문제 : 변수는 숫자 값만을 저장할 수 있을까 ?
//그러하다. 문자값을 넣으면 실행되지않는다.

// 16번 문제 : const 에 값을 저장 후 변경이 가능할까 ?
//const y = 3;
//y = 5; 오류가 뜬다. 곧 저장후 변경이 되지 않는다. 

// 17번 문제 : let 에 값을 저장 후 변경이 가능할까 ?
// let x = 5;
// x = 3;   오류가 뜨지 않는다. 변경 가능하다.

// 18번 문제 : “true”는 Boolean 값일까 ?
// console.log(typeof(true)); 그러하다.

// 19번 문제 : null과 undefined는 같은 데이터 타입일까 ?
//아니다. 
//null : 변수 안에 아무것도 없는 것(변수가 아무 것도 없는 것으로 채워짐)
// undefined : 존재하지 않은 것 컴퓨터 메모리 안에는 존재하지만 값이 없다. 

// 20번 문제 : 배열을 사용하는 이유는 무엇일까 ?
//배열을 사용하면 굳이 const를 이용하여 많은 값을 하나하나 적지않아도 된다. 한번에 가능하다.

// 21번 문제 : 배열 두 번째 요소의 값을 어떻게 얻을 수 있을까 ?
//const icecream = ["초키초키","엄외","스크류바"];
//console.log(icecream[1]);
	
// 22번 문제 : 객체 player의 name의 값을 어떻게 얻을 수 있을까 ?
//console.log(player.name);