// 1번 문제 : 함수를 사용하는 이유는 무엇인가요?
// 코드들을 하나로 합치기 위해 !

// 2번 문제 : 함수를 실행시키기 위해서 어떻게 해야할까?
// 함수명{}

// 3번 문제 : 함수에 왜 인자를 넘겨줄까요?
// 함수는 인자를 가질 수 없다! 함수에서 값을 얻기 위해! 함수에 값을 보내기 위해!

// 4번 문제 : 함수는 최대 인자를 3개 받을 수 있다?
// No

// 5번 문제 : 함수는 항상 인자를 받아야한다?
// No

// 6번 문제 : 함수에서 'return'을 왜 사용할까요?
// 함수에서 값을 얻기 위해!

// 7번 문제 : 'return'은 'console.log' 와 같을까?
// No

// 8번 문제 : parseInt("2")를 하면 어떻게 될까?
// 2

// 9번 문제 : parseInt("hello")를 하면 어떻게 될까?
// NaN

// 10번 문제 : NaN은 무엇일까?
// Not a Number

// 11번 문제 : 이 코드의 결과는 무엇일까요?
// <img src="문제1.jpg">
// bye
// if(false){
//     conslole.log("hi")
// }else{
//     console.log("bye")
// }

// 12번 문제 : 이 코드의 결과는 무엇일까요?
// <img src="문제2.jpg">
// hello
// if(5>10){
//     console.log("hi")
// }else if(8<10){
//     console.log("hello")
// }else{
//     console.log("bye")
// }

// 13번 문제 : 8 > 5 && 10 > 20 의 결과는 무엇일까?
// false
// console.log(8 > 5 && 10 > 20)
// 14번 문제 : 5 > 2 || 10 < 23 의 결과는 무엇일까?
// true
// console.log(5 > 2 || 10 < 23)
// 15번 문제 : false && true 의 결과는 무엇일까?
// false
// console.log(false && true)
// 16번 문제 : true && false 의 결과는 무엇일까?
// false
// console.log(true && false)
// --------------------------------------------------------------------------------------------

